#1. Завантажити дані з файлу firtree.csv, в якому зберігаються результати вигаданого 
#опитування відвідувачів ялинкового базару, і зберегти їх у змінну tree.
tree <- read.csv("C:/Users/Игорь/Desktop/КНТЕУ/4.2 Інструментальні засоби БА (R)/П-3/firtree.csv", na.strings = "")
#2. Вивести імпортований датасет на екран і додатково вивести його в окремому вікні з використанням функції перегляду View.
View(tree)
#3. Вивести перші рядки датасету з використанням функції head. 
head(tree)
#4. Вивести перші 8 рядків датасету tree. 
head(tree, 8)
#5. Вивести останні рядки набору даних з використанням функції tail. 
tail(tree)
#6. Вивести 10 останніх рядків в окремому вікні з використанням функції View.
View(tail(tree, 10))
#7. Визначити вимірність набору даних (кількість рядків і стовпців) за допомогою функції dim.
dim(tree)
#8. Визначити окремо кількість рядків та стовпців, використавши функції ncol() та nrow(). 
ncol(tree)
nrow(tree)
#9. Отримати повний технічний опис датасету (функція str).
str(tree)
#11. Знаючи стовпці і порядкові номери (ID) рядків, що містять пропущені значення, 
#вивести на екран конкретні «порожні» елементи і переконатися, що вони дійсно не містять значень.
tree[47, 20]$wish
#13. Підрахувати кількість рядків датасету, що містять значення NA. 
complete.cases (tree)
#14. Скористатися запереченням функції sum(!complete.cases()) для обчислення кількості значень NA в датасеті.
sum(!complete.cases(tree))
#15. Скористатися іншим способом для пошуку пропущених значень – функцією is.na().
sum(is.na(tree))
#16. Для подальшої роботи з пропущеними значеннями встановити додаткові бібліотеки VIM та mice.
install.packages("VIM")
install.packages("mice")
#17. Підключити встановлені бібліотеки та вивести графіки, які покажуть, 
#в яких змінних пропущених значень найбільше і як виглядає таблиця з пропущеними значеннями.
library(VIM)
library(mice)
aggr(tree)
#18. Використати функцію matrixplot бібліотеки mice. Отриманий графік відповідає за заповненість спостережень
matrixplot(tree)
#19. Скористатися функцією matrixplot для візуалізації пропущених значень датасету test.
test <- cbind.data.frame(a = c(NA, 2, 3), b = c(NA, NA, 1))
matrixplot(test)
