#Task1
#Виконайте наступні завдання: 
#•	обчисліть суму елементів lvl; 
#•	обчисліть середнє елементів lvl; 
#•	визначте медіану елементів lvl; 
#•	визначте з допомогою R довжину змінної lvl; 
#•	обчисліть стандартне відхилення елементів lvl; 
#•	округліть стандартне відхилення до двох знаків після коми.
lvl <- c(8, 10, 10, 1, 10, 10, 8, 12, 1, 12)
sum(lvl)
mean(lvl)
median(lvl)
length(lvl)
sd(lvl)
round(sd(lvl), 2)

#Task2
#Використайте функцію diff() до цих даних. Що ви отримаєте як результат? 
#Ви повинні побачити кількість миль між заправками. Використайте функцію max(), mean() і min(), 
#щоб обчислити максимальний, середній і мінімальний пробіг між заправками.
mileage <- c(65311, 65624, 65908, 66219, 66499, 66821, 67145, 67447)
x <- diff(mileage)
max(x)
mean(x)
min(x)
x

#Task3
#Уявіть, що вам потрібно купити устаткування для вашої фабрики і у вас є 2 варіанти для вибору. 
#Перед прийняттям остаточного рішення, ви вибрали 10 показників ефективності з кожного варіанту. 
#Якщо б ваше остаточне рішення будувалося на цих замірах, яке устаткування ви б вибрали? 
equipment1 <- c(151.2, 150.5, 149.2, 147.5, 152.9, 152.0, 151.3, 149.7, 149.4, 150.7)
equipment2 <- c(151.9, 151.4, 150.3, 151.2, 151.0, 150.2, 151.2, 151.4, 150.4, 151.7)
mean1 <- mean(equipment1)
mean2 <- mean(equipment2)
mean1
mean2
#Середнє значення устаткування 2 вище, тому я би обрав його.

#Task4
#Створіть вектор зросту двадцяти учнів класу:
#Який учень знаходиться посередині цього списку (за зростом)? Який зріст є найбільш популярним? 
#Обчисліть ці величини засобами описової аналітики в R.
height <- c(100, 106, 121, 111, 109, 111, 103, 117, 114, 108, 111, 105, 120, 116, 104, 103, 108, 111, 101, 120)
summary(height)
mean(height)
median(height)
#Учень, що знаходиться посередині цього списку (за зростом) – 110. Мода – 111.


#Task5
#Обчисліть квантилі, квартилі, IQR і стандартну похибку на основі даних з попереднього завдання.
quantile(height)
IQR(height)
sd(height)

#Task6
#Розрахуйте стандартне відхилення для даних із завдання 4 за допомогою формули і порівняйте результати 
#з використанням функції sd(). Чи будуть результати однакові?
x <- c(100, 106, 121, 111, 109, 111, 103, 117, 114, 108, 111, 105, 120, 116, 104, 103, 108, 111, 101, 120)
deviations <- x - mean(x)
squared_deviations <- deviations^2
mean_squared_deviations <- mean(squared_deviations)
standard_deviation <- sqrt(mean_squared_deviations)
sd(x)
standard_deviation
#Як можна побачити, результати трохи відрізняються.

#Task7
#Завантажте дані з двох стовпців таблиці у два вектори. Визначте скошеність у даних візуально 
#з використанням засобів розвідувальної аналітики та з допомогою метрик описової аналітики. Інтерпретуйте результати.
a <- c(212, 869, 220, 654, 511, 624, 420, 121, 428, 865, 799, 405, 230, 670, 870, 366, 99, 55, 489, 312, 493, 163, 221, 84, 144, 48, 375, 86, 168, 100)
b <- c(586, 760, 495, 678, 559, 415, 370, 659, 119, 288, 241, 787, 522, 207, 160, 526, 656, 848, 720, 676, 581, 929, 653, 661, 770, 800, 529, 975, 995, 947)
hist(a, col = "lightblue")
hist(b, col = "yellow")
install.packages("moments")
library(moments)
skewness(a)
skewness(b)
#За результатами обчислень можна зробити наступні висновки:
#Стовпець a має додатню скошеність, що свідчить про те, що середнє значення знаходиться правіше від медіани, 
#а розподіл має виражений "хвіст" у бік вищих значень. Стовпець b має від'ємну скошеність, що свідчить про те, 
#що середнє значення знаходиться лівіше від медіани, а розподіл має виражений "хвіст" у бік нижчих значень.
