#Завантажити дані з файлу firtree.csv, в якому зберігаються результати вигаданого 
#опитування відвідувачів ялинкового базару, і зберегти їх у змінну tree.
tree <- read.csv("C:/Users/Игорь/Desktop/КНТЕУ/4.2 Інструментальні засоби БА (R)/П-3/firtree.csv", na.strings = "")
View(tree)
#Вивести перші рядки датасету з використанням функції head. 
head(tree)
head(tree, 8)
#Вивести останні рядки набору даних з використанням функції tail. 
tail(tree)
#Вивести 10 останніх рядків в окремому вікні з використанням функції View.
View(tail(tree, 10))
#Визначити вимірність набору даних (кількість рядків і стовпців) за допомогою функції dim.
dim(tree)
#Визначити окремо кількість рядків та стовпців, використавши функції ncol() та nrow(). 
ncol(tree)
nrow(tree)
#Отримати повний технічний опис датасету (функція str).
str(tree)
#Знаючи стовпці і порядкові номери (ID) рядків, що містять пропущені значення, 
#вивести на екран конкретні «порожні» елементи і переконатися, що вони дійсно не містять значень.
tree[47, 20]$wish
#Підрахувати кількість рядків датасету, що містять значення NA. 
complete.cases (tree)
#Скористатися запереченням функції sum(!complete.cases()) для обчислення кількості значень NA в датасеті.
sum(!complete.cases(tree))
#Скористатися іншим способом для пошуку пропущених значень – функцією is.na().
sum(is.na(tree))
#Для подальшої роботи з пропущеними значеннями встановити додаткові бібліотеки VIM та mice.
install.packages("VIM")
install.packages("mice")
library(VIM)
library(mice)
#Підключити встановлені бібліотеки та вивести графіки, які покажуть, 
#в яких змінних пропущених значень найбільше і як виглядає таблиця з пропущеними значеннями.
aggr(tree)
#Використати функцію matrixplot бібліотеки mice. Отриманий графік відповідає за заповненість спостережень
matrixplot(tree)
#Скористатися функцією matrixplot для візуалізації пропущених значень датасету test.
test <- cbind.data.frame(a = c(NA, 2, 3), b = c(NA, NA, 1))
matrixplot(test)
